my-app/server/artillery_tests/results/test1_noFk/products_test_log.txt
Test run id: tcjy9_344ggq6zcegnmbxz4xfhmjakytpgq_qjtj
Phase started: Testing Products (index: 0, duration: 5s) 19:26:12(-0400)

Phase completed: Testing Products (index: 0, duration: 5s) 19:26:17(-0400)

--------------------------------------
Metrics for period to: 19:26:20(-0400) (width: 5.22s)
--------------------------------------

http.codes.200: ................................................................ 24
http.downloaded_bytes: ......................................................... 8436
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 25
http.response_time:
  min: ......................................................................... 8
  max: ......................................................................... 1133
  median: ...................................................................... 645.6
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1107.9
http.responses: ................................................................ 24
vusers.completed: .............................................................. 24
vusers.created: ................................................................ 25
vusers.created_by_name.Get product: ............................................ 5
vusers.created_by_name.Get products: ........................................... 5
vusers.created_by_name.Get related: ............................................ 14
vusers.created_by_name.Get styles: ............................................. 1
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 25.4
  max: ......................................................................... 1149.4
  median: ...................................................................... 658.6
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1107.9


All VUs finished. Total time: 11 seconds

--------------------------------
Summary report @ 19:26:24(-0400)
--------------------------------

errors.ETIMEDOUT: .............................................................. 1
http.codes.200: ................................................................ 24
http.downloaded_bytes: ......................................................... 8436
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 25
http.response_time:
  min: ......................................................................... 8
  max: ......................................................................... 1133
  median: ...................................................................... 645.6
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1107.9
http.responses: ................................................................ 24
vusers.completed: .............................................................. 24
vusers.created: ................................................................ 25
vusers.created_by_name.Get product: ............................................ 5
vusers.created_by_name.Get products: ........................................... 5
vusers.created_by_name.Get related: ............................................ 14
vusers.created_by_name.Get styles: ............................................. 1
vusers.failed: ................................................................. 1
vusers.session_length:
  min: ......................................................................... 25.4
  max: ......................................................................... 1149.4
  median: ...................................................................... 658.6
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1107.9