my-app/server/artillery_tests/results/test1_noFk/qna_test_log.txt
Test run id: tay8q_xekkd345bxb5afmp9enx73nq3zqa5_4hkc
Phase started: Testing Questions and Answers (index: 0, duration: 5s) 19:28:18(-0400)

Phase completed: Testing Questions and Answers (index: 0, duration: 5s) 19:28:23(-0400)

--------------------------------------
Metrics for period to: 19:28:20(-0400) (width: 0.221s)
--------------------------------------

http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 5
vusers.created: ................................................................ 5
vusers.created_by_name.Get answers: ............................................ 4
vusers.created_by_name.Get questions: .......................................... 1


All VUs finished. Total time: 15 seconds

--------------------------------
Summary report @ 19:28:35(-0400)
--------------------------------

errors.ETIMEDOUT: .............................................................. 16
http.codes.200: ................................................................ 9
http.downloaded_bytes: ......................................................... 11250
http.request_rate: ............................................................. 3/sec
http.requests: ................................................................. 25
http.response_time:
  min: ......................................................................... 6747
  max: ......................................................................... 8550
  median: ...................................................................... 6838
  p95: ......................................................................... 7709.8
  p99: ......................................................................... 7709.8
http.responses: ................................................................ 9
vusers.completed: .............................................................. 9
vusers.created: ................................................................ 25
vusers.created_by_name.Get answers: ............................................ 13
vusers.created_by_name.Get questions: .......................................... 12
vusers.failed: ................................................................. 16
vusers.session_length:
  min: ......................................................................... 6771.5
  max: ......................................................................... 8561.8
  median: ...................................................................... 6838
  p95: ......................................................................... 7709.8
  p99: ......................................................................... 7709.8