my-app/server/artillery_tests/results/test1_noFk/reviews_test_log.txt
Test run id: t8g4y_xk65c9bmnhfkebmt7tmgxenkfn6ag_nx4m
Phase started: Testing Reviews (index: 0, duration: 5s) 19:26:41(-0400)

Phase completed: Testing Reviews (index: 0, duration: 5s) 19:26:46(-0400)

--------------------------------------
Metrics for period to: 19:26:50(-0400) (width: 6.852s)
--------------------------------------

http.codes.200: ................................................................ 6
http.downloaded_bytes: ......................................................... 3546
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 25
http.response_time:
  min: ......................................................................... 5515
  max: ......................................................................... 5655
  median: ...................................................................... 5598.4
  p95: ......................................................................... 5598.4
  p99: ......................................................................... 5598.4
http.responses: ................................................................ 6
vusers.completed: .............................................................. 6
vusers.created: ................................................................ 25
vusers.created_by_name.Get meta: ............................................... 7
vusers.created_by_name.Get reviews: ............................................ 10
vusers.created_by_name.Get reviews for a product: .............................. 8
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 5540.2
  max: ......................................................................... 5672.2
  median: ...................................................................... 5598.4
  p95: ......................................................................... 5711.5
  p99: ......................................................................... 5711.5


All VUs finished. Total time: 15 seconds

--------------------------------
Summary report @ 19:26:57(-0400)
--------------------------------

errors.ETIMEDOUT: .............................................................. 14
http.codes.200: ................................................................ 11
http.downloaded_bytes: ......................................................... 6843
http.request_rate: ............................................................. 3/sec
http.requests: ................................................................. 25
http.response_time:
  min: ......................................................................... 5515
  max: ......................................................................... 9191
  median: ...................................................................... 5711.5
  p95: ......................................................................... 6976.1
  p99: ......................................................................... 6976.1
http.responses: ................................................................ 11
vusers.completed: .............................................................. 11
vusers.created: ................................................................ 25
vusers.created_by_name.Get meta: ............................................... 7
vusers.created_by_name.Get reviews: ............................................ 10
vusers.created_by_name.Get reviews for a product: .............................. 8
vusers.failed: ................................................................. 14
vusers.session_length:
  min: ......................................................................... 5540.2
  max: ......................................................................... 9210.8
  median: ...................................................................... 5711.5
  p95: ......................................................................... 6976.1
  p99: ......................................................................... 6976.1